# November Unemployment Rate Data Cleaning

In [1]:
import pandas as pd

from collections import Counter

In [2]:
pd.set_option("display.max_rows", 4000)

In [3]:
# Load in data from excel turned csv files

ur_2004 = pd.read_csv('./raw_csv_files/ur_2004.csv')
ur_2008 = pd.read_csv('./raw_csv_files/ur_2008.csv')
ur_2012 = pd.read_csv('./raw_csv_files/ur_2012.csv')
ur_2016 = pd.read_csv('./raw_csv_files/ur_2016.csv')

In [4]:
ur_2004.county = ur_2004.county.map(lambda x: str(x)[:-7] if str(x)[-3] == 'n' or str(x)[-1] == 'h' else str(x)[:-5] + ' Co.')
ur_2008.county = ur_2008.county.map(lambda x: str(x)[:-7] if str(x)[-3] == 'n' or str(x)[-1] == 'h' else str(x)[:-5])
ur_2012.county = ur_2012.county.map(lambda x: str(x)[:-7] if str(x)[-3] == 'n' or str(x)[-1] == 'h' else str(x)[:-5])
ur_2016.county = ur_2016.county.map(lambda x: str(x)[:-7] if str(x)[-3] == 'n' or str(x)[-1] == 'h' else str(x)[:-5])

In [5]:
ur_2004.head()

,county,nov_rate,state,year,2004_pop_est,total area sqmi,water area,land area,per_pov,med_income
0,Autauga,4.5,Alabama,2004,48366,604.45,8.48,595.97,11.6,45379
1,Baldwin,5.7,Alabama,2004,156266,2026.93,430.58,1596.35,10.0,42227
2,Barbour,7.3,Alabama,2004,28287,904.52,19.61,884.90,23.9,26495
3,Bibb,4.8,Alabama,2004,21721,626.16,3.14,623.03,17.1,34055
4,Blount,3.8,Alabama,2004,54124,650.60,5.02,645.59,12.4,38643

In [6]:
ur_2004.shape, ur_2008.shape, ur_2012.shape, ur_2016.shape

((3111, 10), (3111, 10), (3111, 10), (3111, 10))

In [7]:
def replace(df):
    '''Function to replace every state name in dataset with it's abbreviation'''
    
    df.state = df.state.replace('Alabama', 'AL').replace('Arizona', 'AZ').replace('Arkansas', 'AR')
    df.state = df.state.replace('California', 'CA').replace('Colorado', 'CO').replace('Connecticut', 'CT')
    df.state = df.state.replace('Delaware', 'DE').replace('Florida', 'FL').replace('Georgia', 'GA')
    df.state = df.state.replace('Hawaii', 'HI').replace('Idaho', 'ID').replace('Illinois', 'IL')
    df.state = df.state.replace('Indiana', 'IN').replace('Iowa', 'IA').replace('Kansas', 'KS')
    df.state = df.state.replace('Kentucky', 'KY').replace('Louisiana', 'LA').replace('Maine', 'ME')
    df.state = df.state.replace('Maryland', 'MD').replace('Massachusetts', 'MA').replace('Michigan', 'MI')
    df.state = df.state.replace('Minnesota', 'MN').replace('Mississippi', 'MS').replace('Missouri', 'MO')
    df.state = df.state.replace('Montana', 'MT').replace('Nebraska', 'NE').replace('Nevada', 'NV')
    df.state = df.state.replace('New Hampshire','NH').replace('New Jersey', 'NJ').replace('New Mexico', 'NM')
    df.state = df.state.replace('New York', 'NY').replace('North Carolina','NC').replace('North Dakota', 'ND')
    df.state = df.state.replace('Ohio', 'OH').replace('Oklahoma', 'OK').replace('Oregon', 'OR')
    df.state = df.state.replace('Pennsylvania', 'PA').replace('Rhode Island', 'RI').replace('South Carolina', 'SC')
    df.state = df.state.replace('South Dakota', 'SD').replace('Tennessee', 'TN').replace('Texas', 'TX')
    df.state = df.state.replace('Utah', 'UT').replace('Vermont', 'VT').replace('Virginia', 'VA')
    df.state = df.state.replace('Washington', 'WA').replace('West Virginia', 'WV').replace('Wisconsin', 'WI')
    df.state = df.state.replace('Wyoming', 'WY')
    return df

In [8]:
ur_2004 = replace(ur_2004)

ur_2004.county = ur_2004.county + ', ' + ur_2004.state

ur_2004.drop('state', axis=1, inplace=True)

In [9]:
ur_2008 = replace(ur_2008)

ur_2008.county = ur_2008.county + ', ' + ur_2008.state

ur_2008.drop('state', axis=1, inplace=True)

In [10]:
ur_2012 = replace(ur_2012)

ur_2012.county = ur_2012.county + ', ' + ur_2012.state

ur_2012.drop('state', axis=1, inplace=True)

In [11]:
ur_2016 = replace(ur_2016)

ur_2016.county = ur_2016.county + ', ' + ur_2016.state

ur_2016.drop('state', axis=1, inplace=True)

In [12]:
# Townhall distingushes cities that share a name with counties with a 'Co.', 
# and all other cites have only the city name.

# Finds the cities and counties with the same name, creates a list of these duplicates.
uni = []
for count in ur_2004.county:
    if count[-5] == '.':
        x = count[:-8]+count[-4:]
        uni.append(x)
    else:
        uni.append(count)

# cities in this list keep Co. all others drop it

repeted_counties = list({x for x in uni if uni.count(x) > 1})

# removes the 'Co.' from all cities that don't have a count of the same name.

new_county = []
for count in ur_2004.county:
    if 'Co.' in count:
        if count[:-8] + count[-4:] not in repeted_counties:
            new_county.append(count[:-8] + count[-4:])
        elif count[:-8] + count[-4:] in repeted_counties:
            new_county.append(count)
    else:
        new_county.append(count)
new_county_2 = []            
for count in new_county:
    if 'Saint ' in count:
        count = count.replace('Saint', 'St.')
        new_county_2.append(count)
    elif 'Dekalb' in count:
        count = count.replace('Dekalb', 'DeKalb')
        new_county_2.append(count)
    elif 'Desoto' in count:
        count = count.replace('Desoto', 'DeSoto')
        new_county_2.append(count)
    elif 'Lamoure' in count:
        count = count.replace('Lamoure', 'LaMoure')
        new_county_2.append(count)
    elif 'Mc Kean' in count:
        count = count.replace('Mc Kean', 'McKean')
        new_county_2.append(count) 
    elif 'Du Page' in count:
        count = count.replace('Du Page', 'DuPage')
        new_county_2.append(count)
    elif 'Dewitt' in count:
        count = count.replace('Dewitt', 'DeWitt') 
        new_county_2.append(count)
    elif 'Debaca' in count:
        count = count.replace('Debaca', 'De Baca')
        new_county_2.append(count)
    elif 'Baltimore Co.' in count:
        count = count.replace('Baltimore Co.', 'Baltimore City')
        new_county_2.append(count)
    elif count == 'Baltimore, MD':
        count = count.replace('Baltimore, MD', 'Baltimore County, MD')
        new_county_2.append(count) 
    elif count == 'Carson, NV':
        count = count.replace('Carson, NV', 'Carson City, NV')
        new_county_2.append(count)    
    elif count == 'Shannon, SD':
        count = count.replace('Shannon, SD', 'Oglala Lakota, SD')
        new_county_2.append(count)     
    else:
        new_county_2.append(count)

In [13]:
len(new_county), len(new_county_2)

(3111, 3111)

In [14]:
# replaces county names with the new list
# replaces county names with the new list

ur_2004.county = new_county_2

ur_2008.county = new_county_2

ur_2012.county = new_county_2

ur_2016.county = new_county_2

In [15]:
len(ur_2004.county.unique())

3111

In [16]:
ur_2004.head()

,county,nov_rate,year,2004_pop_est,total area sqmi,water area,land area,per_pov,med_income
0,"Autauga, AL",4.5,2004,48366,604.45,8.48,595.97,11.6,45379
1,"Baldwin, AL",5.7,2004,156266,2026.93,430.58,1596.35,10.0,42227
2,"Barbour, AL",7.3,2004,28287,904.52,19.61,884.90,23.9,26495
3,"Bibb, AL",4.8,2004,21721,626.16,3.14,623.03,17.1,34055
4,"Blount, AL",3.8,2004,54124,650.60,5.02,645.59,12.4,38643

In [17]:
ur_2012.head()

,county,nov_rate,year,2012_pop_est,total area sqmi,water area,land area,per_pov,med_income
0,"Autauga, AL",6.1,2012,55027,604.45,8.48,595.97,12.7,51441
1,"Baldwin, AL",6.7,2012,190403,2026.93,430.58,1596.35,13.9,48867
2,"Barbour, AL",10.3,2012,27132,904.52,19.61,884.90,29.0,30287
3,"Bibb, AL",7.6,2012,22645,626.16,3.14,623.03,21.5,37392
4,"Blount, AL",5.9,2012,57772,650.60,5.02,645.59,16.2,44225

In [18]:
ur_2016.head()

,county,nov_rate,year,2016_pop_est,total area sqmi,water area,land area,per_pov,med_income
0,"Autauga, AL",5.0,2016,55416,604.45,8.48,595.97,13.5,54487
1,"Baldwin, AL",5.2,2016,208563,2026.93,430.58,1596.35,11.7,56460
2,"Barbour, AL",8.1,2016,25965,904.52,19.61,884.90,29.9,32884
3,"Bibb, AL",6.2,2016,22643,626.16,3.14,623.03,20.1,43079
4,"Blount, AL",5.1,2016,57704,650.60,5.02,645.59,14.1,47213

In [19]:
ur_2004.to_csv('./csv_files/nov_ur_2004', index=False)

ur_2008.to_csv('./csv_files/nov_ur_2008', index=False)

ur_2012.to_csv('./csv_files/nov_ur_2012', index=False)

ur_2016.to_csv('./csv_files/nov_ur_2016', index=False)